<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"><html><head><title>You&#8217;ve been hacked! - Der Yahoo!-Webmail-Wurm Yamanner</title></head><body><h1>You&#8217;ve been hacked! - Der Yahoo!-Webmail-Wurm Yamanner</h1><p>Die Informationen in der folgenden Beschreibung des Yahoo!-Webmail-WurmsYamanner stammen zum Teil aus dem Whitepaper &quot;MaliciousYahooligans&quot;(<a href="http://www.symantec.com/avcenter/reference/malicious.yahooligans.pdf">PDF</a>)von Symantec.  Der Code des Wurms wurde u.a.  <a href="http://groovin.net/stuff/yammer.txt">auf groovin.net</a>ver&ouml;ffentlicht, die von mir <a href="yamanner-code.html">formatierte und kommentierte Version </a>basiert darauf.</p><p>Yamanner nutzte eine Schwachstelle im JavaScript- und HTML-Filter vonYahoo! Mail f&uuml;r seine Verbreitung: Die Daten wurden einmalgepr&uuml;ft, dabei gefundene unerw&uuml;nschte Bestandteile gel&ouml;scht,und das Ergebnis dann ohne weitere Pr&uuml;fung verwendet. Schon aus dieserBeschreibung l&auml;sst sich eine Angriffstaktik ableiten: Man kombiniertden JavaScript-Code so, das nach dem L&ouml;schen von unerw&uuml;nschtenBestandteilen funktionsf&auml;higer (Schad)code &uuml;brig bleibt. Undgenau so wurde der Wurm auch tats&auml;chlich eingeschleust. Einfallstorwar folgendes <code>&lt;img&gt;</code>-Tag:</p><pre><code>&lt;img src='http://us.i1.yimg.com/us.yimg.com/i/us/nt/ma/ma_mail_1.gif'    target=&quot;&quot;onload=&quot;[Wurm-Code]&quot;&gt;</code></pre><p>Eigentlich sollte in den &quot;-Zeichen hinter <code>target</code> einFrame oder eine Seite als Ziel f&uuml;r das zu ladende Bild angegebenwerden. Stattdessen folgt direkt darauf, ohne trennendes Leerzeichen, ein<code>onload</code>-Attribut. Der Grund f&uuml;r diese merkw&uuml;rdigeFormatierung ist Yahoo!s HTML-Filter, der <code>target</code>-Attributeausfiltert. Damit ergibt sich nach dem Filtern</p><pre><code>&lt;img src='http://us.i1.yimg.com/us.yimg.com/i/us/nt/ma/ma_mail_1.gif'    onload=&quot;[Wurm-Code]&quot;&gt;</code></pre><p>Das ist g&uuml;ltiges HTML, und beim Laden wird der Wurm-Code im<code>onload</code>-Attribut ausgef&uuml;hrt. Der Yahoo!-Filter machte nureinen Durchlauf und pr&uuml;fte das Tag nach dem Entfernen des<code>target=&quot;&quot;</code> nicht noch einmal. Bei einem zweitenDurchlauf w&auml;re das <code>onload</code>-Attribut mit dem enthaltenenWurm-Code gefunden und gel&ouml;scht worden.</p><p>Nach dem Ausbruch des Wurm wurde die Schwachstelle nat&uuml;rlich behoben(und der Wurm dadurch gestoppt), und obiges Ausgangstag wird seitdem in</p><pre><code>&lt;img src='http://us.i1.yimg.com/us.yimg.com/i/us/nt/ma/ma_mail_1.gif'     onfiltered=&quot;[Wurm-Code]&quot;&gt;</code></pre><p>umgewandelt. W&auml;hrend das <code>target</code>-Attribut weiterhingel&ouml;scht wird, wird das <code>onload</code>-Attribut durch Umwandlungin das ung&uuml;ltige <code>onfiltered</code> unbrauchbar gemacht: Derenthaltene Code wird nicht mehr ausgef&uuml;hrt.</p><h2>Der Wurm-Code</h2><p>Sobald ein Benutzer eine wurmverseuchte E-Mail in Yahoo! Webmail&ouml;ffnete, wurde der Wurmcode ausgef&uuml;hrt. Alle Aktionen des Wurmswurden &uuml;ber XMLHttpRequests im Hintergrund durchgef&uuml;hrt. Dererste Schritt bestand darin, den aktuellen Server festzustellen. Da Yahoo!seine Webanwendungen &uuml;ber eine Vielzahl von Servern verteilt, musstef&uuml;r die XMLHttpRequests der aktuell verwendete Server ermitteltwerden. Danach wurde &uuml;ber die &quot;QuickBuilder&quot;-Funktion inallen verf&uuml;gbaren Verzeichnissen nach Adressen gesucht, die noch nichtim Adressbuch des Opfers gespeichert waren. Die ersten 100 gefundenenAdressen wurden daraufhin gepr&uuml;ft, ob sie auf @yahoo.com oder@yahoogroups.com enden (denn nur dort konnte der Wurm ja ausgef&uuml;hrtwerden). Au&szlig;erdem wurde die Adresse des Opfers und des Senders desWurms aus den von Yahoo! ausgef&uuml;llten Formularfeldern gelesen, damitder Wurm sich nicht selbst an ein vorheriges Opfer schickt. An die f&uuml;rden Wurm brauchbaren Adressen wurde dann eine Kopie des Wurms geschickt:Eine der Adressen wurde in das To:-Feld eingetragen, alle anderen in dasBCC:-Feld. Bevor die Mail abgeschickt werden konnte, musste der sog.'crumb' ermittelt werden, ein zuf&auml;llig erzeugter Hashwert, mit demYahoo! das automatische Versenden von Mails verhindert.</p><p>Nachdem der Wurmcode ausgef&uuml;hrt wurde, wurde der Benutzer auf eineandere Website weitergeleitet, wobei verschiedene Parameter &uuml;bertragenwurden: Zum einen die gefundenen E-Mail-Adressen, zum anderen verschiedeneParameter aus der Yahoo!-URL, die vermutlich zur Tarnung der Mailadressendienten, die dadurch in der URL-Zeile nicht mehr sichtbar waren. Auf derals Ziel dienenden Seite wurde Werbung eingeblendet, der Wurm sollte alsowahrscheinlich f&uuml;r reichlich Traffic und damit verbunden h&ouml;hereEinnahmen des Wurm-Autors sorgen.</p><p>Laut <a href="https://isc.sans.edu/diary/Yahoo%21+mass-mailer/1398">Internet Storm Center</a>gibt es zwei Varianten des Wurms, bei der zweiten wurden Fehler korrigiert.Beide funktionierten aber aufgrund weiterer Fehler nicht so, wie vom Autorgedacht. Z.B. sollte ein Browserfenster f&uuml;r www.lastdata.comge&ouml;ffnet werden, was aber an einem Schreibfehler (www,lastdata.com)scheiterte.</p><h2>Die Folgen</h2><p>Das Ziel der Weiterleitung enthielt einen Besucherz&auml;hler, so das dieInfektionsrate ermittelt werden konnte. Am 11. und 12. Juni 2006 wurdenungef&auml;hr 200.000 Mail-Accounts infiziert. Danach wurde der Wurm durcheine Korrektur des JavaScript-Filters ausgerottet.</p><hr><p>Weiter<a href="yamanner-code.html">zum Wurm-Code</a>oder zur&uuml;ck<a href="../kapitel5.html">zur Kapitel-Startseite</a>oder<a href="../../hacking-index.html">zur Doku-Startseite</a></p></body></html>